AlmAck/svdtonuttx/demo/h/da1470_memctrl.h
/* BUSY_STAT Register */

#define MEMCTRL_BUSY_SDADC_MASK                (0x3 << 30) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SDADC_POS                 (30) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_GPADC_MASK                (0x3 << 28) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_GPADC_POS                 (28) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SRC2_MASK                 (0x3 << 26) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SRC2_POS                  (26) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SRC_MASK                  (0x3 << 24) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SRC_POS                   (24) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_PDM_MASK                  (0x3 << 22) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_PDM_POS                   (22) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_PCM_MASK                  (0x3 << 20) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_PCM_POS                   (20) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I3C_MASK                  (0x3 << 18) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I3C_POS                   (18) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I2C3_MASK                 (0x3 << 16) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I2C3_POS                  (16) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I2C2_MASK                 (0x3 << 14) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I2C2_POS                  (14) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I2C_MASK                  (0x3 << 12) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_I2C_POS                   (12) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SPI3_MASK                 (0x3 << 10) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SPI3_POS                  (10) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SPI2_MASK                 (0x3 << 8) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SPI2_POS                  (8) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SPI_MASK                  (0x3 << 6) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_SPI_POS                   (6) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_UART3_MASK                (0x3 << 4) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_UART3_POS                 (4) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_UART2_MASK                (0x3 << 2) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_UART2_POS                 (2) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_UART_MASK                 (0x3 << 0) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_UART_POS                  (0) /* A non-zero value indicates the resource is busy. The value represents which mast */

/* BUSY_STAT2 Register */

#define MEMCTRL_BUSY_TIMER6_MASK               (0x3 << 10) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER6_POS                (10) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER5_MASK               (0x3 << 8) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER5_POS                (8) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER4_MASK               (0x3 << 6) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER4_POS                (6) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER3_MASK               (0x3 << 4) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER3_POS                (4) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER2_MASK               (0x3 << 2) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER2_POS                (2) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER_MASK                (0x3 << 0) /* A non-zero value indicates the resource is busy. The value represents which mast */
#define MEMCTRL_BUSY_TIMER_POS                 (0) /* A non-zero value indicates the resource is busy. The value represents which mast */

/* CMAC_STATUS Register */

#define MEMCTRL_CMI_CLEAR_READY                (1U << 13) /* Writing a '1' clears CMI_NOT_READY bit. */
#define MEMCTRL_CMI_NOT_READY                  (1U << 12) /* 0: Normal operation 1: CMI access performed which couldn't be handled right away */
#define MEMCTRL_AHB_RFMON_WR_BUFF_CNT_MASK     (0xF << 8) /* The maximum number of arbiter clock cycles that an CPUC AHB access has been buff */
#define MEMCTRL_AHB_RFMON_WR_BUFF_CNT_POS      (8) /* The maximum number of arbiter clock cycles that an CPUC AHB access has been buff */
#define MEMCTRL_AHB_SYS2CMAC_WR_BUFF_CNT_MASK  (0xF << 4) /* The maximum number of arbiter clock cycles that an CPUS_AHB access has been buff */
#define MEMCTRL_AHB_SYS2CMAC_WR_BUFF_CNT_POS   (4) /* The maximum number of arbiter clock cycles that an CPUS_AHB access has been buff */
#define MEMCTRL_AHB_RFMON_CLR_WR_BUFF          (1U << 3) /* Writing a '1' clears AHB_CPUC_WR_BUFF_CNT. */
#define MEMCTRL_AHB_SYS2CMAC_CLR_WR_BUFF       (1U << 2) /* Writing a '1' clears AHB_CPUS_WR_BUFF_CNT. */
#define MEMCTRL_AHB_RFMON_WRITE_BUFF           (1U << 1) /* 0: No CPUC AHB write access is buffered. 1: Currently a single CPUC AHB write ac */
#define MEMCTRL_AHB_SYS2CMAC_WRITE_BUFF        (1U << 0) /* 0: No CPUS AHB write access is buffered. 1: Currently a single CPUS AHB write ac */

