AlmAck/svdtonuttx/demo/h/da1470_memctrl.h
/* MEM_STATUS Register */

#define MEMCTRL_AHB_SNC_WR_BUFF_CNT_MASK       (0xF << 20) /* The maximum number of arbiter clock cycles that an SNC AHB access has been buffe */
#define MEMCTRL_AHB_SNC_WR_BUFF_CNT_POS        (20) /* The maximum number of arbiter clock cycles that an SNC AHB access has been buffe */
#define MEMCTRL_AHB_DMA_WR_BUFF_CNT_MASK       (0xF << 16) /* The maximum number of arbiter clock cycles that an DMA AHB access has been buffe */
#define MEMCTRL_AHB_DMA_WR_BUFF_CNT_POS        (16) /* The maximum number of arbiter clock cycles that an DMA AHB access has been buffe */
#define MEMCTRL_AHB_CPUC_WR_BUFF_CNT_MASK      (0xF << 12) /* The maximum number of arbiter clock cycles that an CPUC AHB access has been buff */
#define MEMCTRL_AHB_CPUC_WR_BUFF_CNT_POS       (12) /* The maximum number of arbiter clock cycles that an CPUC AHB access has been buff */
#define MEMCTRL_AHB_CPUS_WR_BUFF_CNT_MASK      (0xF << 8) /* The maximum number of arbiter clock cycles that an CPUS_AHB access has been buff */
#define MEMCTRL_AHB_CPUS_WR_BUFF_CNT_POS       (8) /* The maximum number of arbiter clock cycles that an CPUS_AHB access has been buff */
#define MEMCTRL_AHB_SNC_CLR_WR_BUFF            (1U << 7) /* Writing a '1' clears AHB_SNC_WR_BUFF_CNT. */
#define MEMCTRL_AHB_DMA_CLR_WR_BUFF            (1U << 6) /* Writing a '1' clears AHB_DMA_WR_BUFF_CNT. */
#define MEMCTRL_AHB_CPUC_CLR_WR_BUFF           (1U << 5) /* Writing a '1' clears AHB_CPUC_WR_BUFF_CNT. */
#define MEMCTRL_AHB_CPUS_CLR_WR_BUFF           (1U << 4) /* Writing a '1' clears AHB_CPUS_WR_BUFF_CNT. */
#define MEMCTRL_AHB_SNC_WRITE_BUFF             (1U << 3) /* 0: No SNC AHB write access is buffered. 1: Currently a single SNC AHB write acce */
#define MEMCTRL_AHB_DMA_WRITE_BUFF             (1U << 2) /* 0: No DMA AHB write access is buffered. 1: Currently a single DMA AHB write acce */
#define MEMCTRL_AHB_CPUC_WRITE_BUFF            (1U << 1) /* 0: No CPUC AHB write access is buffered. 1: Currently a single CPUC AHB write ac */
#define MEMCTRL_AHB_CPUS_WRITE_BUFF            (1U << 0) /* 0: No CPUS AHB write access is buffered. 1: Currently a single CPUS AHB write ac */

#endif /* __DA1470_MEMCTRL_H */
